# CreateIFCAnyHandle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..CreateIFCAnyHandle Method
IFCData Class See Also
---
Creates an IFCAnyHandle data object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static IFCData CreateIFCAnyHandle(
	IFCAnyHandle value
)
```

Visual Basic
---
```text
Public Shared Function CreateIFCAnyHandle ( _
	value As IFCAnyHandle _
) As IFCData
```

Visual C++
---
```text
public:
static IFCData^ CreateIFCAnyHandle(
	IFCAnyHandle^ value
)
```

# ### Parameters
value
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The IFCAnyHandle value.
# ### Return Value
The IFCData object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace